In [2]:
import pandas as pd

### Reindexing

In [3]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
obj.dtype

dtype('float64')

In [6]:
# Using reindex method
# Place NaN if no value is found
obj1 = obj.reindex(['a','b','c','d','e'])
obj1

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [7]:
obj2 = pd.Series(['blue','purple','yellow'], index=[0,2,4])
obj2

0      blue
2    purple
4    yellow
dtype: object

In [15]:
obj2.reindex(range(6), method ='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [16]:
import numpy as np

In [21]:
frame = pd.DataFrame(np.arange(9).reshape(3,3), index=['a','c','d'], columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [22]:
frame2 = frame.reindex(['a','b','c','d'])

In [23]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [24]:
frame2.columns

Index(['Ohio', 'Texas', 'California'], dtype='object')

In [25]:
frame2.columns = ['California', 'Texas', 'Ohio']

In [26]:
frame2

   California  Texas  Ohio
a         0.0    1.0   2.0
b         NaN    NaN   NaN
c         3.0    4.0   5.0
d         6.0    7.0   8.0

In [27]:
frame2.columns = ['Ohio','Texas','California'] 
# Only labels are replaced, values remain same

In [28]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [29]:
frame2.reindex(columns=['California','Texas','Utah'])
# Whole column is replaced

   California  Texas  Utah
a         2.0    1.0   NaN
b         NaN    NaN   NaN
c         5.0    4.0   NaN
d         8.0    7.0   NaN

In [30]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [42]:
frame.loc[['c','d','a'],['California','Ohio','Texas']]

   California  Ohio  Texas
c           5     3      4
d           8     6      7
a           2     0      1

### Dropping Entries from an Axis